# @Time: 2024/7/16 下午11:42
# @Author:xfzhang0602
# @File:demo4.py
# @Software: PyCharm

'''
#整型(int)
#type()函数可以查看变量的类型
a10 = 100           #数字100，十进制表示
print(type(a10))
a2 = 0b01100100     #数字100，二进制表示
print(a2,type(a2))
a8 = 0o144          #数字100，八进制表示
print(a8,type(a8))
a16 = 0x64          #数字100，十流进制表示
print(a16,type(a16))



#十进制转为二进制
print(bin(100)) #binary
#十进制转为八进制
print(oct(100)) #octonary
#十进制转为十六进制
print(hex(100)) #hexadecimal
#二进制：01100100 0 * 2**7 + 1 * 2**6 + 1 * 2**5 + 0 * 2**4 + 0 * 2**3
#               + 1 * 2**2 + 0 * 2**1 + 0 * 2**0
#十进制：100 1 * 10**2 + 0 * 10**1 + 0 * 10**0
#八进制：144 1 * 8**2 + 4 * 8**1 + 4 * 8**0
#十六进制：64 6 * 16**1 + 4 * 16**0
'''





