# @Time: 2024/7/16 下午11:42
# @Author:xfzhang0602@163.com
# @File:demo4.py
# @Software: PyCharm

'''
#(1)整数 + - * /
print("7 + 2 = ",7 + 2)
print("7 - 2 = ",7 - 2)
print("7 * 2 = ",7 * 2)
print("7 / 2 = ",7 / 2)

#(2)浮点数 + - * /
#对大多数实数，计算机都无法精确存储。这造成误差。
#在用计算机解决实际问题时，要考虑上述误差的积累。
print("0.1 + 0.1 = ", 0.1 + 0.1)
print("0.1 - 0.1 = ", 0.1 - 0.1)
print("0.1 * 0.1 = ", 0.1 * 0.1) #计算机无法精确存储0.01，存储了它的近似值。
print("0.1 / 0.1 = ", 0.1 / 0.1)
print("0.3 == 3 * 0.1\t", 0.3 == 3 * 0.1)

a = 0.2
b = 0.1
print("a + b = ", a + b) #计算机无法精确存储0.3，存储了它的近似值。

#(3) 幂运算 **
c = 2 ** 10 #2的10次方（幂）
print("2 ** 10 = ",2 ** 10)


#(4) 整数除法 //
a = 4/2 #除法，默认是小数
print(a,type(4/2))


# a = 7/0 #除零错误
a = 7//2 #取整,向下取最接近的整数
print("7 // 2 = ",7 // 2)
print("-7 // 2 = ",-7 // 2)

#(5) 模运算 %
b = 7 % 2 #取余数
# print(b,type(b))
print("7 % 2 = ",7 % 2)


#(6) divmod() 同时获得商和余数
d,e = divmod(7,2)
print(d) #商
print(e) #余数



a = 3
b = 4
print(a == b) #表示a和b的值是否相等，用两个等号
print(a != b)
print(a > b)
print(a < b)
print(a >= b)
print(a <= b)



a = 60
b = 13
print(bin(a))
print(bin(b))
'''


a=0b00111100
b=0b00001101
print("a & b",a & b) #12, 1100

































